[
    {
        "id": 1,
        "estate_title": "Modern Single-family Home",
        "segment_name": "Single-family homes",
        "description": "Discover this stunning modern single-family home that combines contemporary design with comfortable living. Featuring four spacious bedrooms, three luxurious bathrooms, and an open-concept living area, this home offers plenty of space for family and entertainment. The gourmet kitchen is equipped with high-end appliances and a large island, making it a chef's dream. Step outside to a beautifully landscaped backyard with a patio, perfect for outdoor gatherings and relaxation. Built in 2018, this home is located at 123 Main St, City, State, and offers 2500 sqft of living space. Don't miss the opportunity to make this dream home yours!",
        "price": "$500,000",
        "Status": "sale",
        "Area": "2500 sqft",
        "location": "123 Main St, City, State",
        "facilities": ["living room", "kitchen", "backyard"],
        "image": "https://i.ibb.co/L0Wmz22/lancia-homes-single-family-home-what-it-actually-is-image1.jpg",
        "ViewProperty": "View Property Details",
        "bedrooms": 4,
        "bathrooms": 3,
        "year_built": 2018,
        "parking_spaces": 2,
        "open_house_dates": ["2024-05-01", "2024-05-15"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 2,
        "estate_title": "Townhouse with City",
        "description": "Experience urban living at its finest in this stylish townhouse with breathtaking city views. This three-bedroom, 2.5-bathroom home is nestled in the heart of the city at 456 Elm St, City, State. The spacious and light-filled living area is perfect for both relaxing and entertaining, while the modern kitchen features sleek countertops and high-quality appliances. Enjoy morning coffee or evening cocktails on your private balcony overlooking the city skyline. Built in 2020, this 1800 sqft townhouse also includes a garage for convenient parking. Don't miss out on this rare opportunity to live in a prime location with panoramic city views.",
        "price": "$400,000",
        "Status": "sale",
        "Area": "1800 sqft",
        "location": "456 Elm St, City, State",
        "facilities": ["living room", "balcony", "garage"],
        "image": "https://i.ibb.co/XZKtVWW/bb0fc26f-00d1-4063-9420-c4392b58e645.webp",
        "ViewProperty": "View Property Details",
        "bedrooms": 3,
        "bathrooms": 2.5,
        "year_built": 2020,
        "parking_spaces": 1,
        "open_house_dates": ["2024-04-20", "2024-05-10"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 3,
        "estate_title": "Luxury Apartment",
        "segment_name": "Apartments",
        "description": "Indulge in luxurious living in this upscale apartment located at 789 Oak St, City, State. Boasting two spacious bedrooms and two elegant bathrooms, this apartment offers a perfect blend of comfort and sophistication. The state-of-the-art kitchen features top-of-the-line appliances, sleek cabinetry, and a breakfast bar, making it a joy for cooking enthusiasts. Residents can enjoy a range of exclusive amenities, including a swimming pool, gym, 24/7 security, and concierge service. With 1500 sqft of living space and built in 2019, this apartment is available for rent at $3,000 per month. Don't miss the chance to experience luxury living at its finest.",
        "price": "$3,000/month",
        "Status": "rent",
        "Area": "1500 sqft",
        "location": "789 Oak St, City, State",
        "facilities": ["living room", "swimming pool", "gym"],
        "image": "https://i.ibb.co/3m9Z17h/Park-Line-apartment-in-Miami-FL.jpg",
        "ViewProperty": "View Property Details",
        "bedrooms": 2,
        "bathrooms": 2,
        "year_built": 2019,
        "parking_spaces": 1,
        "amenities": ["24/7 security", "concierge service"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 4,
        "estate_title": "Student Housing Near Campus",
        "segment_name": "Student housing",
        "description": "Find your perfect student housing solution close to campus at 101 College Ave, City, State. This cozy and convenient one-bedroom, one-bathroom apartment is ideal for students seeking a comfortable and accessible living space. The apartment features a spacious living room, study area, and in-unit laundry facilities for added convenience. Utilities including water and electricity are included in the monthly rent of $1,200. With 1200 sqft of living space and built in 2021, this student housing option offers a great opportunity for students to live in a comfortable and supportive environment.",
        "price": "$1,200/month",
        "Status": "rent",
        "Area": "1200 sqft",
        "location": "101 College Ave, City, State",
        "facilities": ["living room", "study area", "laundry"],
        "image": "https://i.ibb.co/4VBxBht/image.jpg",
        "ViewProperty": "View Property Details",
        "bedrooms": 1,
        "bathrooms": 1,
        "year_built": 2021,
        "parking_spaces": "Shared parking",
        "utilities_included": ["Water", "Electricity"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 5,
        "estate_title": "Senior Living Community",
        "segment_name": "Senior living communities",
        "description": "Experience the comfort and convenience of senior living at 111 Senior St, City, State. This peaceful and supportive senior living community offers various amenities and services to ensure a high quality of life for residents. The community features different types of apartments including studios, one-bedroom, and two-bedroom units, each designed with seniors' needs in mind. Amenities include a dining hall, healthcare services, fitness center, and organized community events. With 2000 sqft of living space and a monthly rent of $4,500, this senior living community provides a safe and welcoming environment for seniors to enjoy their golden years.",
        "price": "$4,500/month",
        "Status": "rent",
        "Area": "2000 sqft",
        "location": "111 Senior St, City, State",
        "facilities": ["living room", "dining hall", "medical care"],
        "image": "https://i.ibb.co/m64PsKJ/bench-blog.jpg",
        "ViewProperty": "View Property Details",
        "apartment_types": ["Studio", "1-bedroom", "2-bedroom"],
        "amenities": ["Healthcare services", "Fitness center", "Community events"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 6,
        "estate_title": "Beachfront Vacation Rental",
        "segment_name": "Vacation rentals",
        "description": "Escape to paradise with this stunning beachfront vacation rental located at 123 Beach Blvd, City, State. This spacious three-bedroom, two-bathroom rental offers breathtaking ocean views and direct beach access, making it the perfect getaway spot for families or groups of friends. The rental features a fully equipped kitchen, a comfortable living room, and a private patio overlooking the ocean. With sleeping accommodations for up to eight guests, this 1600 sqft vacation rental is available for $300 per night. Don't miss the opportunity to relax and unwind in this tropical beachfront oasis.",
        "price": "$300/night",
        "Status": "rent",
        "Area": "1600 sqft",
        "location": "123 Beach Blvd, City, State",
        "facilities": ["living room", "swimming pool", "patio"],
        "image": "https://i.ibb.co/0c55KNt/d03d9889-b6c3-42f5-ad84-2c6c4b7a57b2.webp",
        "ViewProperty": "View Property Details",
        "bedrooms": 3,
        "bathrooms": 2,
        "sleeps": 8,
        "available_dates": ["2024-06-01", "2024-06-15"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 7,
        "estate_title": "Cozy Retirement Home",
        "segment_name": "Senior living communities",
        "description": "Enjoy a peaceful and comfortable retirement in this cozy retirement home located at 222 Retirement Ln, City, State. This two-bedroom, two-bathroom home offers 1800 sqft of living space, providing ample room for relaxation and entertainment. The home features a spacious living room, a well-maintained garden, and a garage for convenient parking. Residents can also enjoy community amenities such as a community center and walking trails. Built in 2017, this retirement home is available for sale at $250,000, offering a great opportunity for seniors to enjoy their retirement years in a supportive and welcoming community.",
        "price": "$250,000",
        "Status": "sale",
        "Area": "1800 sqft",
        "location": "222 Retirement Ln, City, State",
        "facilities": ["living room", "garden", "garage"],
        "image": "https://i.ibb.co/P96tkzT/istockphoto-672176380-612x612.jpg",
        "ViewProperty": "View Property Details",
        "bedrooms": 2,
        "bathrooms": 2,
        "year_built": 2017,
        "parking_spaces": 1,
        "amenities": ["Community center", "Walking trails"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 8,
        "estate_title": "Spacious Townhouse for Rent",
        "segment_name": "Townhouses",
        "description": "Experience comfortable and modern living in this spacious townhouse available for rent at 789 Maple St, City, State. This three-bedroom, 2.5-bathroom townhouse offers 2100 sqft of living space, providing plenty of room for families or individuals. The open-concept living area features a modern kitchen with stainless steel appliances, sleek countertops, and a spacious patio perfect for outdoor dining and relaxation. With two designated parking spaces and utilities including water and trash included in the monthly rent of $2,200, this townhouse offers a convenient and hassle-free living experience.",
        "price": "$2,200/month",
        "Status": "rent",
        "Area": "2100 sqft",
        "location": "789 Maple St, City, State",
        "facilities": ["living room", "kitchen", "patio"],
        "image": "https://i.ibb.co/VBbs905/1520179521577.jpg",
        "ViewProperty": "View Property Details",
        "bedrooms": 3,
        "bathrooms": 2.5,
        "year_built": 2022,
        "parking_spaces": 2,
        "utilities_included": ["Water", "Trash"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    },
    {
        "id": 9,
        "estate_title": "Downtown Apartment with Views",
        "segment_name": "Apartments",
        "description": "Live in style in this luxurious downtown apartment located at 333 City Center Dr, City, State. This two-bedroom, two-bathroom apartment offers 1700 sqft of living space and features stunning city views from its private balcony. The apartment boasts a modern kitchen with high-end appliances, a spacious living room, and access to a range of exclusive amenities including a rooftop terrace and fitness center. With underground parking available and built in 2020, this apartment is available for sale at $550,000, offering a fantastic opportunity for urban living in a prime location.",
        "price": "$550,000",
        "Status": "sale",
        "Area": "1700 sqft",
        "location": "333 City Center Dr, City, State",
        "facilities": ["living room", "swimming pool", "balcony"],
        "image": "https://i.ibb.co/B2rFrGZ/Screen-Shot-2020-01-23-at-1-09-14-PM-0.jpg",
        "ViewProperty": "View Property Details",
        "bedrooms": 2,
        "bathrooms": 2,
        "year_built": 2020,
        "parking_spaces": "Underground parking",
        "amenities": ["Rooftop terrace", "Fitness center"],
        "coordinates": {
            "latitude": 40.7128,
            "longitude": -74.0060
        }
    }
]
